papers/strategy/re-frame.tex
% Created 2025-02-25 Tue 17:40
% Intended LaTeX compiler: pdflatex
\documentclass[12pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{setspace}
\singlespacing
\usepackage[pdftex]{graphicx} % enhanced support for graphics
\usepackage{tikz}             % Easier syntax to draw pgf files (invokes pgf automatically)
\usepackage{multicol}
\author{Eric}
\date{25-feb-2025}
\title{A frame to re-write the strategy paper}
\hypersetup{
 pdfauthor={Eric},
 pdftitle={A frame to re-write the strategy paper},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\maketitle
\noindent The paper needs serious surgery. Not just to meet reviewers' concerns, but in itself too. I propose a central line of argument (more or less implicit in Alejandro's manuscript) to re-write it. This should help simplify the paper considerably, offering clearer picture. For this, we need to make one point. I also propose some re-organization, showing where selected parts of Alejandro's manuscript will fit, and what needs to be expanded/modified/added. 

I suggest discussing whether this central line of argument works, and how to improve it/adapt it for the purpose of clerifying our argument first, apart from journal reviewers. Once we have agreement among ourselves, we should then move to find overlap with reviewers' critiques and recommendations. If there is enough overlap, we can resubmit a revised manuscript. Otherwise, we should try a fresh submission in a different journal. 
\section{Intro: A simple frame for a reconceptualization}
\label{sec:org060bea7}
A possible central line of argument puts two competing claims side by side:
\begin{description}
\item[{Claim 1}] Redistricting by politicians/parties, unchecked, is problematic for democratic competition. This claim is common, often taken for granted in American politics. So much so, that much reform effort aims at totally expunging politicians from redistricting.
\item[{Claim 2}] But redistricting by experts, in full disconnect from politicians/parties, is problematic in its own ways too. This argument is less common and requires elaboration, but it is equally valid. (Eg. why not let AI redistrict?)
\end{description}

\noindent Democratic redistricting should fall somewhere between claims 1 and 2. Not a black and white story, but a shades of gray one. As with shades-of-gray arguments, finding optimal proportions of black and white is tricky/impossible.

Our new intro should argue about the fundamental role that politicians and their parties play in redistricting and in organizing elections. Provided, of course, their involvement is somehow constrained. Which leads to the classic tensions that underlie limited government: how to check dominant actors, and how to guard the guardians. (We could also present this as a Madisonian dilemma).

Some examples:
\begin{itemize}
\item Jacobson on how, soon after the reapportionment revolution, the zero malapportionment requirement led to systematically splitting counties and other natural political communities, severing the ties between incumbents and their parties. And, perhaps, a key source of incumbency advantage.
\item Estevez et al. on how designing Mexico's IFE as a collective agent of the parties made electoral regulation credible to everyone. Evidence suggests that portraying themselves as operating above the partisan fray (like judges do everywhere) is part of the job description, even if their actions reveal them as party watchdogs.
\item California's redistricting commission is formally forbidden from taking prior voting, incumbent address, and so forth into consideration in map making. Elaborate on the potential problems such prohibitions create.
\item Need more lines of argument, in order to choose which help us land the shades-of-gray argument more clearly.
\end{itemize}
Our revised paper seeks to inform the experts/parties tension with a systematic study of a process where mapmakers operate an automated redistricting process with systematic input by the parties. 

We do not aim to `resolve' the issue of what the ideal mixture is. We instead seek to determine whether or not, how, and how much parties attempt to modify expert proposals, and how succesful each is in a competitive process. 
\section{Electoral regulation in Mexico}
\label{sec:orge5b6785}
In this section we should take a step back to present not just redistricting, but electoral regulation in general as subject to the experts/parties tension. The section could take the same general approach as Estevez et al. in describing the delegation dilemmas that Mexican parties have faced when setting up a powerful election referee. The discussion will set forth some (mild) expectations from the analysys.
\subsection{INE as a collective agent of the three major parties}
\label{sec:org19a52f1}
IFE/INE was designed by/for the three major parties in 1990s. How agency costs were mitigated through screening, monitoring, checks and balances. System has never been perfect. But, other than in 2006, it seemed to work---losers conceded.  
\subsection{Party system collapse}
\label{sec:orgcf57d36}
That ceased to be so when a new entrant, Morena, upended the party system in 2015. The new party rose to win the 2018 presidential election, yet remained excluded from the regulatory arrangement between 2015 to 2022. The three-party system fragmented further with a new, single dominant player. Sudden change was a major problem for credible electoral regulation in general, and possibly redistricting in particular. Sudden change also sets up tension to study the strategic, competitive party interactions. Did the forerly major parties attempt to stack the deck against Morena? How did Morena play the redistricting game before it managed to gain control of the electoral regulator? How did experts react to the change in expectations. 
\section{Mexico's redistricting process.}
\label{sec:org4ecee07}
Expand on Alejandro's section 2 (h i j). More expectations from the analysys will be discussed here.
\subsection{Redistricting history}
\label{sec:orgf4b1276}
New maps were drawn in 1997, 2006, 2018, and 2024. And a 2015 plan was finalized, but abandoned (which we analyze too). Mentioning that redistricting has always involved a considerable lag with the census count it relies upon, introducing a fair degree of malapportionment, may help add . 
\subsection{The process in 2018 and 2024}
\label{sec:orgbf17ac6}
Explain the process with more detail. Doing so will elaborate the criteria for optimization, which in themselves are quantities of interest in our analysis.
\subsection{INE's optimizing criteria}
\label{sec:orgd1100ce}
\begin{itemize}
\item seats reserved for indigenous communities (removed from optimization)
\item malapportionment (\(\pm 10\) to 15\%)
\item preserving political borders
\item practicable districts
\item compactness
\end{itemize}
\subsection{`Criterion 8' for stopping the machine by unanimity (and other known exceptions)}
\label{sec:org04bf28f}
We should compare this subset of districts against those generated through the standard process.
\section{Other quantities of interest}
\label{sec:orgc56c7da}
Some are already analyzed in Alejandro's manuscript. More could be added:
\begin{itemize}
\item preserving the recent past (risk aversion)
\item preserving cabeceras distritales (bureaucratic inertia, INE's real estate)
\item vote margins against the winner (party bias)
\item wasted votes (packing/cracking)
\item seats from votes (responsiveness)
\item seat swings relative to vote swings (responsiveness take 2).
\end{itemize}
We will also have some (mild) expectations regarding these quantities.
\section{Reorganize Alejandro's empirical exploration}
\label{sec:org4b5bb81}
Much of the above is already in Alejandro's manuscript. But much isn't. Empirical explorations should provide answers to our general expectations. Adding new quantities to our analysis will enrich our attempt to gauge party influence over the process and outcomes. 
\begin{itemize}
\item Eg. (bureaucratic inertia) If the algorithm were left on its own, some cabeceras distritales should change. How many actually did?
\item Eg. (risk aversion) If parties were risk averse, counter offers should tend to reconfigure some parts of the old map. Did they? (Cox and Katz's District similarity index could help here.)
\item Eg. (protecting bastions) If parties seek security, counter offers should boost margins at the expense of responsiveness. Did they?
\item Eg. (unpacking/uncracking) If parties reduce vote wasting, counter offers should bring more margins closer to plurality. Did they?
\end{itemize}
If we come up with a list of such questions, it will make reorganizing the empirical explorations simpler, and produce a set of findings that contribute to our general point. 
\section{A discussion of interest beyond Mexican studies}
\label{sec:org6b04b12}
The paper should close by wrapping up the findings and discussing them in light of redistricting in other latitudes. Te case of the US will inevitably be an important part of this final discussion, but we can attempt to expand th scope.
\end{document}
